class PortMapScript extends AllScripts {
    constructor(world) {
        super();
        let city_square = world.scriptObjects.city_square;
        city_square.occupiedTiles = [
            [0, 0, 0, 1, 1, 0, 1, 1, 1, 0, 0, 0, 1, 1, 1, 1, 1, 1, 0, 0, 0, 0],
            [1, 1, 0, 1, 1, 0, 1, 1, 1, 0, 0, 0, 1, 1, 1, 1, 1, 1, 0, 0, 0, 0],
            [1, 1, 0, 0, 0, 0, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 1, 1, 0],
            [1, 1, 0, 1, 1, 0, 1, 1, 1, 0, 0, 0, 1, 1, 1, 0, 1, 1, 0, 1, 1, 0],
            [0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 1, 1, 0],
            [0, 1, 1, 1, 1, 1, 1, 1, 0, 0, 0, 0, 0, 1, 1, 0, 1, 1, 0, 1, 1, 0],
            [0, 1, 1, 1, 1, 1, 1, 1, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 0, 0, 0, 0],
            [0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0],
            [1, 1, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 1, 1, 0],
            [1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 1, 1, 0],
            [1, 1, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 1, 1, 0],
            [1, 1, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0],
            [1, 1, 0, 1, 1, 1, 1, 1, 0, 0, 0, 0, 0, 1, 1, 0, 1, 1, 0, 1, 1, 0],
            [1, 1, 0, 1, 1, 1, 1, 1, 0, 0, 0, 0, 0, 1, 1, 0, 1, 1, 0, 1, 1, 0],
            [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
        ];
    }

    setupRecalculatedData(world) {
        let baseTile = {
            pixelX: {
                get: () => {
                    let q = globalTimer * 64 + Math.cos(globalTimer / 6 * (2 * Math.PI)) * 32;
                    return q % (tileSize * (world.width + 24)) - 12 * tileSize;
                }
            },
            y: 51
        }
        world.animations.add(new GiantTurtle(6), baseTile, true);
    }

    nextTurn(forced) {
        this._executeTriggers()
    }

    //checkCanCast() {
        // let messages = [
        //     "Магию в городе использовать запрещено.",
        //     "За такое и оштрафовать могут. А у меня и так денег нет.",
        //     "Колдовать в районе университета можно только на занятиях. Или на экзамене. Или на пересдаче.",
        //     "В городе использовать опасные заклинания нельзя. В тюрьму посадят. Хотя вообще-то тюрьмы у нас нет."
        // ]
        // ui.dialogUI.addMessage(randomFrom(messages), playerSpeaker, player);
        // return false;
    //}

    onItemUse(item) {
        return false;
    }
};
